Revit 2027 API
PanelScheduleView.GetApparentPhaseValue Method
 Gets the apparent load for the given phase for the given slotted circuit
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetApparentPhaseValue(
	ElementId circuitId,
	ElementId apparentLoadParam
)
Public Function GetApparentPhaseValue (
	circuitId As ElementId,
	apparentLoadParam As ElementId
) As Double
public:
double GetApparentPhaseValue(
	ElementId^ circuitId,
	ElementId^ apparentLoadParam
)
member GetApparentPhaseValue :
        circuitId : ElementId *
        apparentLoadParam : ElementId -> float
Parameters
circuitId ElementId
 Circuit id for the apparent phase value
apparentLoadParam ElementId
 The requested apparent load phase parameter
Return Value
Double
 The value of the apparent phase
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace